Documents/ЗаявкаНаПроведениеИсследования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПроведениеИсследования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсследования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсследованияМониторингаОпроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КатегорииТовара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатурыУРЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыНоменклатурыУРЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПлановыйАссортимент</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставкаНаСклад</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставкаПроизводителем</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведенияИсследования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПрикрепления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыИсследованияМониторингаОпроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыИсследованияМониторингаОпроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ППП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпросНаСайтеВСоцСетях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпросОффлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФокусГруппы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпросВМагазинеБезДегустации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпросВМагазинеСДегустацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторингЦен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаПроведениеИсследования/Ext/ObjectModule.bsl
//+++AK Lobv рассылка уведомления при созданнии новой заявки
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ЭтоНовый() тогда
		МассивПолучателей=Новый Массив;
		Если ТипИсследования=Перечисления.ТипыИсследованияМониторингаОпроса.ППП тогда
			МассивПолучателей.Добавить("annyllat@gmail.com");
		ИначеЕсли ТипИсследования=Перечисления.ТипыИсследованияМониторингаОпроса.ОпросНаСайтеВСоцСетях тогда
			МассивПолучателей.Добавить("pr@izbenka.msk.ru");
			МассивПолучателей.Добавить("annyllat@gmail.com");
		Иначе
			МассивПолучателей.Добавить("research@izbenka.msk.ru");
			МассивПолучателей.Добавить("research@vkusvill.ru");
		КонецЕсли;
		
		Если МассивПолучателей.Количество()>0 тогда
			УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки();
			Почта = Новый ИнтернетПочта;
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			Письмо = Новый ИнтернетПочтовоеСообщение;
			Почта.Подключиться(Профиль);
			НомерДляПисьма=1;
			Запрос1=Новый Запрос;
			Запрос1.Текст="ВЫБРАТЬ
			             |	ЗаявкаНаПроведениеИсследования.Номер КАК Номер
			             |ИЗ
			             |	Документ.ЗаявкаНаПроведениеИсследования КАК ЗаявкаНаПроведениеИсследования
			             |ГДЕ
			             |	ЗаявкаНаПроведениеИсследования.Дата >= &Дата
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	Номер УБЫВ";
			Запрос1.УстановитьПараметр("Дата",НачалоГода(ТекущаяДата()));
			ТаблицаНомеров=Запрос1.Выполнить().Выгрузить();
			Если ТаблицаНомеров.Количество()>0 тогда
				Попытка
					НомерДляПисьма=Число(ТаблицаНомеров[0].Номер)+1;
				Исключение
				КонецПопытки;
			КонецЕсли;
			Письмо.Тема = "Создана новая заявка на проведение исследования, мониторинга, опроса №"+Строка(НомерДляПисьма)+" от "+Строка(Дата);
			ТекстСообщения = Письмо.Тексты.Добавить();
			ТекстСообщения.Текст     = 
			"Заказчик: "+Строка(Заказчик)+Символы.ПС+
			"Приоритет: "+Строка(Приоритет)+Символы.ПС+
			"Тип исследования: "+Строка(ТипИсследования)+Символы.ПС+
			"Срок: "+?(ЗначениеЗаполнено(СрокВыполнения),Строка(Формат(СрокВыполнения,"ДЛФ=Д")),"не указан")+Символы.ПС+Символы.ПС+
			"Запрос:"+Строка(Запрос)+Символы.ПС;
			ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
			
			Письмо.ИмяОтправителя = ""+УчетнаяЗапись+"";
			Письмо.ИмяОтправителя  = ""+СокрЛП(УчетнаяЗапись)+"";
			Письмо.Отправитель     = ""+СокрЛП(УчетнаяЗапись)+"";
			
			Для каждого АдресИзМассива из МассивПолучателей цикл
				Получатель = Письмо.Получатели.Добавить();
				Получатель.Адрес           = АдресИзМассива;
				Получатель.ОтображаемоеИмя = АдресИзМассива;
			КонецЦикла;
			Почта.Послать(Письмо);
			Почта.Отключиться();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//--АК
